Repository: FreePBX-ContributedModules/synology
Catalog: i18n/*/LC_MESSAGES/synologyabb.po
Languages: es_es

source: Active Backup for Business server IP address.
es_es: Dirección IP del servidor Active Backup for Business.

source: After the installation is complete, please type `abb-cli -c` to connect to Synology NAS and create the backup task.
es_es: Una vez completada la instalación, escriba `abb-cli -c` para conectarse al NAS Synology y crear la tarea de copia de seguridad.

source: Agent Version: %s
es_es: Versión del Agente: %s

source: Another way to check if it is installed is to look at the directory where the kernels are installed, it should look something like this:
es_es: Otra forma de verificar si está instalado es mirar el directorio donde están instalados los núcleos, debería verse así:

source: Are you sure you want to disconnect this device from the backup server?
es_es: ¿Está seguro de que desea desconectar este dispositivo del servidor de copia de seguridad?

source: Backup Info (%s):
es_es: Información de la Copia de Seguridad (%s):

source: Backup in Progress...
es_es: Copia de Seguridad en Progreso...

source: Canceled
es_es: Cancelada

source: Check status backup
es_es: Verifique el estado de la copia de seguridad

source: Command [%s] not found!
es_es: ¡Comando [%s] no encontrado!

source: Command not found!
es_es: ¡Comando no encontrado!

source: Command to run (see --help)
es_es: Comando para ejecutar (ver --help)

source: Completed
es_es: Completada

source: Connection Info:
es_es: Información de Conexión:

source: Device Removed From Server
es_es: Dispositivo Eliminado del Servidor

source: Device Successfully Disconnected!
es_es: ¡Dispositivo Desconectado con Éxito!

source: Device Successfully Registered!
es_es: ¡Dispositivo Registrado con Éxito!

source: Disconnect Device from Server
es_es: Desconectar Dispositivo del Servidor

source: Done!
es_es: ¡Hecho!

source: Download Completed Successful
es_es: Descarga Completada con Éxito

source: Download Failed!
es_es: Descarga Fallida!

source: Download the agent from <a href="https://archive.synology.com/download/Utility/ActiveBackupBusinessAgent" target="_blank">here</a>
es_es: Descargar el agente <a href="https://archive.synology.com/download/Utility/ActiveBackupBusinessAgent" target="_blank">desde aquí</a>

source: Downloading (Retry %s)...
es_es: Descargando (Reintento %s)...

source: Downloading...
es_es: Descargando...

source: Enter command line to install Linux snapshot driver and Linux backup service. Administrator role is required to execute the command.
es_es: Ingrese la línea de comando para instalar el controlador de instantáneas de Linux y el servicio de copia de seguridad de Linux. Se requiere el rol de administrador para ejecutar el comando.

source: Error in process SaveInfo. Error Type [%s] in file [%s:%s], message: %s
es_es: Error en el proceso SaveInfo. Error de tipo [%s] en el archivo [%s:%s], mensaje: %s

source: Extracting....
es_es: Extrayendo....

source: Extraction Completed Successful
es_es: Extracción Completada con Éxito

source: Failed
es_es: Fallida

source: For Linux server with internet connection, the required components will be installed automatically by running the installation script.
es_es: Para un servidor Linux con conexión a Internet, los componentes necesarios se instalarán automáticamente ejecutando el script de instalación.

source: For Linux servers without internet connection, you will need to download the required components and install them before running the installation script.
es_es: Para servidores Linux sin conexión a Internet, deberá descargar los componentes necesarios e instalarlos antes de ejecutar el script de instalación.

source: For example:
es_es: Por ejemplo:

source: Force Update Status Info
es_es: Forzar a actualizar los datos

source: Force refresh
es_es: Forzar Actualización

source: Getting Backup Status...
es_es: Obteniendo el estado de la copia de seguridad...

source: Hook file is empty!
es_es: ¡El archivo de gancho está vacío!

source: Hook run exceeded tiemout!
es_es: ¡La ejecución del gancho excedió el tiempo de espera!

source: Hook token is invalid!
es_es: ¡El token de gancho no es válido!

source: IP/Address Server
es_es: IP/Dirección del Servidor

source: If all this is correct we will check if the symbolic link of <b><i>"/lib/modules/{version}/build"</i></b> exists.
es_es: Si todo esto es correcto comprobaremos si existe el enlace simbólico de <b><i>"/lib/modules/{version}/build"</i></b>.

source: If you are on CentOS8, "kernel-headers-$(uname -r)" is needed, otherwise "kernel-devel-$(uname -r)"
es_es: Si está en CentOS8, se necesita "kernel-headers-$(uname -r)" de lo contrario, "kernel-devel-$(uname -r)".

source: In the installation process the compilation of the kernel module fails, the following error is seen: In kernel headers for this kernel does not seem to be installed.
es_es: En el proceso de instalación falla la compilación del módulo del kernel, se ve el siguiente error: In kernel headers for this kernel does not seem to be installed.

source: Install Active Backup for Business Linux Agent
es_es: Instale Active Backup for Business Agente Linux

source: Install Now
es_es: Instalar Ahora

source: Installation Completed Successfully
es_es: Instalación Completada con Éxito

source: Installation Wizard
es_es: Asistente de Instalación

source: Installation complete
es_es: Instalación completa

source: Installing...
es_es: Instalando...

source: Introduction
es_es: Introducción

source: Invalid param
es_es: Parámetro no válido

source: Last Backup Time:
es_es: Fecha Ultima Copia:

source: Last backup completed successfully - %s
es_es: Última copia de seguridad completada con éxito - %s

source: Latest version detected:
es_es: Última versión detectada:

source: Linux distributions:
es_es: Distribuciones de Linux:

source: Loading...
es_es: Cargando...

source: Logout from Server
es_es: Desconectar del Servidor

source: Missing Arguments!
es_es: ¡Faltan Argumentos!

source: More info click <a href="https://kb.synology.com/en-global/DSM/help/ActiveBackupBusinessAgent/activebackupbusinessagent?version=7" target="_blank">here</a>
es_es: Más información, haga clic <a href="https://kb.synology.com/en-global/DSM/help/ActiveBackupBusinessAgent/activebackupbusinessagent?version=7" target="_blank">aquí</a>

source: Necessary param [%s] is missing!
es_es: Falta el parámetro necesario [%s]!

source: Needs a param
es_es: Necesita parámetro

source: Next Backup Time:
es_es: Fecha Próxima Copia:

source: No Connection
es_es: Sin Conexión

source: No mistake, everything ok.
es_es: No hay error, todo ok.

source: Not Connection, pending configuration!
es_es: ¡No está conectado, pendiente de configurar!

source: Nothing has been defined yet.
es_es: Aún no se ha definido nada.

source: On my system that file did not exist and because of this the kernel module that has to be compiled during the installation process shows the error message.
es_es: En mi sistema, ese archivo no existía y, por eso el módulo del kernel que debe compilarse durante el proceso de instalación muestra el mensaje de error.

source: Once we have created this, we start the installation/update process again.
es_es: Una vez que hemos creado esto, comenzamos de nuevo el proceso de instalación/actualización.

source: Opcion 1:
es_es: Opción 1:

source: Opcion 2:
es_es: Opción 2:

source: Page Not Found (%s)!!!!
es_es: Página no Encontrada (%s)!!!!

source: Param is empty [%s]
es_es: El parámetro está vacío [%s]

source: Password
es_es: Contraseña

source: Path for abb-cli
es_es: Ruta para abb-cli

source: Pending First Copy
es_es: Primera Copia Pendiente

source: Please Wait...
es_es: Espere por favor...

source: Please switch the role to root before execution.
es_es: Cambie el rol a root antes de la ejecución.

source: Please wait...
es_es: Por favor espera...

source: Portal Recovery
es_es: Portal de Recuperacion

source: Problem:
es_es: Problema:

source: Process Manual Installation
es_es: Proceso de Instalación Manual

source: Process Terminated By Error!
es_es: ¡Proceso terminado debido a un error!

source: Register Device
es_es: Registrar Dispositivo

source: Required components on the target device:
es_es: Componentes necesarios en el dispositivo de destino:

source: Review the FAQ section of the manual installation process for more information on how to fix this problem.
es_es: Revisa la sección FAQ del proceso de instalación manual para obtener mas información de como solucionar este problema.

source: Searching Latest Version...
es_es: Buscando la Última Versión...

source: Server Address:
es_es: Dirección del Servidor:

source: Service Status:
es_es: Estado del Servicio:

source: Show help
es_es: Mostrar ayuda

source: Show version Agent Installed
es_es: Mostrar versión Agente instalado

source: Since the module build process failed, trying to reinstall the update will still cause build issues.
es_es: Dado que el proceso de compilación del módulo falló, intentar reinstalar la actualización aún causará problemas de compilación.

source: Solution:
es_es: Solución:

source: Started data update process...
es_es: Proceso de actualización de datos iniciado...

source: Starting Installation...
es_es: Iniciando la Instalación...

source: Status Backup
es_es: Estado de la Copia de Seguridad

source: Status Unknown
es_es: Estado Desconocido

source: Step 1
es_es: Paso 1

source: Step 2
es_es: Paso 2

source: Step 3
es_es: Paso 3

source: Step 4
es_es: Paso 4

source: Synology Active Backup for Business Agent Installation Guide
es_es: Guía de Instalación del Agente de Synology Active Backup for Business

source: Synology Active Backup for Business functions
es_es: Funciones de Synology Active Backup for Business

source: Synology Agent Already connected!
es_es: ¡El Agente de Synology ya está conectado!

source: Synology Agent Is Installing...
es_es: El Agente Synology se esta Instalando...

source: Synology Agent Not Already Connected!
es_es: ¡El Agente de Synology aún no está conectado!

source: Synology Agent ended in error!
es_es: ¡El Agente Synology terminó con error!

source: Synology Agent not Installed!
es_es: ¡El Agente Synology no esta instalado!

source: Synology Agent not return info!
es_es: ¡El Agente Synology no devuelve información!

source: Synology Agent returned uncontrolled information!
es_es: ¡El Agente Synology devolvió información no controlada!

source: System requirement
es_es: Requisitos del sistema

source: The Agent by Synology Active Backup for Business is not Installed!
es_es: ¡El Agente de Synology Active Backup for Business no está Instalado!

source: The Password field cannot be empty!
es_es: ¡El campo Contraseña no puede estar vacío!

source: The Server field cannot be empty!
es_es: ¡El campo Servidor no puede estar vacío!

source: The Username field cannot be empty!
es_es: ¡El campo Nombre de Usuario no puede estar vacío!

source: The default path to abb-cli. overwrite as needed.
es_es: La ruta por defecto de abb-cli. Sobrescribir según sea necesario.

source: The file that returns the hook information does not exist!
es_es: ¡El archivo que devuelve la información del gancho no existe!

source: The first thing is to check that we have kernel-devel installed with:
es_es: Lo primero es comprobar que tenemos kernel-devel instalado con:

source: The installation file contains Linux snapshot driver and the Linux backup service.
es_es: El archivo de instalación contiene el controlador de instantáneas de Linux y el servicio de copia de seguridad de Linux.

source: The server is not available!
es_es: ¡El servidor no está disponible!

source: The server returned an authentication failed error!
es_es: ¡El servidor devolvió un error de autenticación fallida!

source: The status code (%s) is not controlled!
es_es: ¡El código de estado (%s) no está controlado!

source: The system does not support automatic installation!
es_es: ¡El sistema no admite la instalación automática!

source: The username or password you entered is incorrect!
es_es: ¡El nombre de usuario o la contraseña son incorrectos!

source: This IP address has been blocked because it has reached the maximum number of failed login attempts allowed within a specific time period!
es_es: ¡Esta dirección IP ha sido bloqueada porque alcanzó el número máximo de intentos de inicio de sesión fallidos permitidos dentro de un período de tiempo específico!

source: This error has been presented to me in a FreePBX distribution (Sangoma Linux release 7.8.2003 (Core)) and this is the solution that I have found.
es_es: Este error se me ha reproducido en la distribución FreePBX (Sangoma Linux release 7.8.2003 (Core)) que se base en CentOS y esta es la solución que he encontrado.

source: To learn more commands about Active Backup for Business Linux Agent, please type `abb-cli -h`.
es_es: Para obtener más información sobre los comandos de Active Backup for Business Linux Agent, escriba `abb-cli -h`.

source: To solve this, before starting the update process we must delete <b><i>"/usr/src/synosnap-{version}/"</i></b>, or do a <b><i>"make clean"</i></b> inside the directory <b><i>"/usr/src/synosnap-{version}/"</i></b>
es_es: Para solucionar esto, antes de iniciar el proceso de actualización debemos borrar <b><i>"/usr/src/synosnap-{version}/"</i></b>, o hacer un <b><i>"make clean"</i></b> dentro del directorio <b><i>"/usr/src/synosnap-{version}/"</i></b>

source: Try Again
es_es: Intenta de Nuevo

source: Type "yum remove synology-active-backup-business-linux-service" to uninstall the backup service.
es_es: Escriba "yum remove synology-active-backup-business-linux-service" para desinstalar el servicio de copia de seguridad.

source: Type "yum remove synosnap" to uninstall the driver.
es_es: Escriba "yum remove synosnap" para desinstalar el controlador.

source: Uninstall the agent
es_es: Desinstalar el agente

source: Unknown Error!
es_es: ¡Error Desconocido!

source: Unknown error (%s)!
es_es: ¡Error desconocido (%s)!

source: Upgrading configs..
es_es: Actualizando configuraciones..

source: User with which this equipment will be added to the server.
es_es: Usuario con el que se añadirá este equipo al servidor.

source: Username
es_es: Nombre de Usuario

source: Username:
es_es: Nombre de Usuario:

source: Warning [%s]: %s
es_es: Advertencia [%s]: %s

source: We create the symbolic link:
es_es: Creamos el enlace simbólico:

source: YES
es_es: SÍ

source: version or above
es_es: o superior
